//==============================================================================||
//*	ZaRan	-	A Totally Automatic CFD Software								||
//*	Copyright (C) ,Since 2020													||
//*-----------------------------------------------------------------------------||
//*	License																		||
//*	This file is part of ZaRan.													||
//*																				||
//*	@file	Gradient.h															||
//*	@brief	根据流场信息，求出对应的梯度    										||
//*	@author	Chen Jie.															||
//==============================================================================||
#pragma once

//todo